In [3]:
import pandas as pd
import numpy as np

In [4]:
#Operations
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(df)
print(df['col2'].unique())
print(df['col2'].nunique())   #唯一的数及其个数

print(df['col2'].value_counts())   #某一列每个数据出现的个数

print(df[(df['col1']>2) & (df['col2']==444)])  #条件语法已然适用

def square(x):
    return x**2
print(df['col1'].apply(square))   #apply一个自定义函数
print(df['col2'].apply(lambda x:x**2))   #同理lambda

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
[444 555 666]
3
col2
444    2
555    1
666    1
Name: count, dtype: int64
   col1  col2 col3
3     4   444  xyz
0     1
1     4
2     9
3    16
Name: col1, dtype: int64
0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [5]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
df.sort_values(by='col2') #按照第二列数据大小排序，其余与其一致

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [8]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
print(df)
#新函数，新型多维数据，值+下标+列，一一对应
df.pivot_table(values='D',index=['A','B'],columns=['C'])

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [9]:
#Input and Output data

df = pd.read_csv('example.csv')
print(df)
#df.to_csv('Output',index=False)  #Output了一个新csv文件

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [11]:
#df.to_excel('haha.xlsx',sheet_name='sheet2')   #output了新的excel文件

In [13]:
#reading HTML
#df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [16]:
#sql not recommended but worth being aware
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')
df.to_sql('mytable',engine)
sqldf = pd.read_sql('mytable',con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15